; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared7 - mode
	infrared6 - mode
	image4 - mode
	spectrograph2 - mode
	infrared5 - mode
	infrared1 - mode
	image8 - mode
	spectrograph0 - mode
	spectrograph3 - mode
	Star2 - direction
	Star4 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph3)
	(supports instrument1 image8)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared6)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 infrared6)
	(supports instrument3 infrared7)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Phenomenon6)
	(have_image Planet5 image8)
	(have_image Planet5 spectrograph0)
	(have_image Planet5 infrared5)
	(have_image Phenomenon6 spectrograph3)
	(have_image Phenomenon6 image4)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 image4)
	(have_image Star7 image8)
	(have_image Planet8 spectrograph3)
	(have_image Planet8 infrared5)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared6)
	(have_image Star9 infrared5)
	(have_image Planet10 infrared6)
	(have_image Planet10 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   goals met: 1 of 17
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 17
3. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 17
4. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   goals met: 0 of 17
5. (take_image satellite0 star7 instrument1 image8)
   added: (have_image star7 image8)
   goals met: 1 of 17
6. (turn_to satellite0 planet5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet5)
   goals met: 1 of 17
7. (take_image satellite0 planet5 instrument1 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 2 of 17
8. (take_image satellite0 planet5 instrument1 image8)
   added: (have_image planet5 image8)
   goals met: 3 of 17
9. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 17
10. (take_image satellite0 planet10 instrument1 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 17
11. (turn_to satellite0 star1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star1)
   goals met: 4 of 17
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 17
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 17
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 17
15. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 4 of 17
16. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 17
17. (take_image satellite0 phenomenon6 instrument0 image4)
   added: (have_image phenomenon6 image4)
   goals met: 5 of 17
18. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 5 of 17
19. (take_image satellite0 star7 instrument0 image4)
   added: (have_image star7 image4)
   goals met: 6 of 17
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 17
21. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 17
22. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 6 of 17
23. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 6 of 17
24. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 17
25. (take_image satellite0 phenomenon6 instrument2 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 7 of 17
26. (take_image satellite0 phenomenon6 instrument2 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 8 of 17
27. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 8 of 17
28. (take_image satellite0 planet10 instrument2 infrared6)
   added: (have_image planet10 infrared6)
   goals met: 9 of 17
29. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 9 of 17
30. (take_image satellite0 planet8 instrument2 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 10 of 17
31. (take_image satellite0 planet8 instrument2 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 11 of 17
32. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 12 of 17
33. (turn_to satellite1 star3 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star3)
   goals met: 12 of 17
34. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 12 of 17
35. (turn_to satellite1 planet5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet5)
   goals met: 12 of 17
36. (take_image satellite1 planet5 instrument3 infrared5)
   added: (have_image planet5 infrared5)
   goals met: 13 of 17
37. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 13 of 17
38. (take_image satellite1 planet8 instrument3 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 14 of 17
39. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 14 of 17
40. (take_image satellite1 star9 instrument3 infrared5)
   added: (have_image star9 infrared5)
   goals met: 15 of 17
41. (take_image satellite1 star9 instrument3 infrared6)
   added: (have_image star9 infrared6)
   goals met: 16 of 17
42. (turn_to satellite1 phenomenon6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon6)
   goals met: 17 of 17
